//====================================================================================================================
//====================================================================================================================
// src/init/socket.js
// 소켓 관리
//====================================================================================================================
//====================================================================================================================

import { Server as SocketIO } from 'socket.io';
import registerHandler from '../handlers/register.handler.js';

// 소켓 초기화, 이벤트 핸들러 등록
const initSocket = (server) => {
    // const io = new SocketIO();
    const io = new SocketIO(server, {
        cors: {
            origin: "*", // 모든 출처 허용 (테스트용)
            methods: ["GET", "POST"]
        }
    });
    registerHandler(io);
};

export default initSocket;

//================

